using UnityEngine;
using System;
using System.Collections.Generic;

public static class EnumableExtensions
{
	//@@-------------------------------------------------------------------------------------------------------------------------
	//@@-------------------------------------------------------------------------------------------------------------------------

	/// <summary>
	/// enum 타입의 모든 멤버 값을 하나씩 반환하는 확장 함수
	/// </summary>
	public static void EnumForeach<T>( Action<T> output ) where T : Enum
	{
		foreach( T value in Enum.GetValues( typeof( T ) ) )
		{
			output.SafeExcute( value );
		}
	}

	//@@-------------------------------------------------------------------------------------------------------------------------
	//@@-------------------------------------------------------------------------------------------------------------------------

}//EnumableExtensions
