/**---------------------------------------------------------------------------------
 * @file UIDirectionBase.cs
 * @brief 연출용 베이스 클레스입니다. 중간 연출 UI는 이 클래스를 상속받아 구현합니다.
 *///-------------------------------------------------------------------------------
using UnityEngine;
using Cysharp.Threading.Tasks;

/// <summary>
/// @class UIDirectionBase
/// @brief 연출용 베이스 클레스입니다. 중간 연출 UI는 이 클래스를 상속받아 구현합니다.
/// </summary>
public class UIDirectionBase : MonoBehaviour
{
	//@@-------------------------------------------------------------------------------------------------------------------------
	//@@-------------------------------------------------------------------------------------------------------------------------

	protected UniTaskCompletionSource _completeSource = null;

	//@@-------------------------------------------------------------------------------------------------------------------------
	//@@-------------------------------------------------------------------------------------------------------------------------

	/// <summary>
	/// 연출이 끝났음을 알립니다. Play()에서 반환된 UniTaskCompletionSource의 결과가 완료되도록 합니다.
	/// </summary>
	protected virtual void Finish()
	{
		if( null != _completeSource )
		{
			_completeSource.TrySetResult();
		}
	}

	//@@-------------------------------------------------------------------------------------------------------------------------

	/// <summary>
	/// 연출을 시작합니다. 연출이 끝나면 Finish()를 호출하여 Play()에서 반환된 UniTaskCompletionSource의 결과가 완료되도록 합니다.
	/// 비동기 제어가 필요한 경우 Play().Task 를 await하여 연출이 끝날 때까지 기다릴 수 있습니다.
	/// </summary>
	/// <returns></returns>
	public virtual UniTaskCompletionSource Play()
	{
		_completeSource = new UniTaskCompletionSource();

		return _completeSource;
	}

	//@@-------------------------------------------------------------------------------------------------------------------------
	//@@-------------------------------------------------------------------------------------------------------------------------
}//UIDirectionBase
